import React from 'react'
import { c07, c08, c09, c10, c11, c12, c13, c14 } from '../assets'

import Grid from '@mui/material/Unstable_Grid2'
import {
  CardActionArea,
  CardMedia,
  Box,
  CardContent,
  Typography,
  Card,
  Paper,
  InputAdornment,
  TextField,
  Button,
} from '@mui/material'
import { Link } from 'react-router-dom'
import LinesEllipsis from 'react-lines-ellipsis'
import { Search } from '@mui/icons-material'
const data = [
  {
    id: 7,
    name: 'نمایندگی',
    photo: c07,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفیبا همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفیبا همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفیبا همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 8,
    name: 'نمایندگی',
    photo: c08,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 9,
    name: 'نمایندگی',
    photo: c09,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 10,
    name: 'نمایندگی',
    photo: c10,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 11,
    name: 'نمایندگی',
    photo: c11,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 12,
    name: 'نمایندگی',
    photo: c12,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 13,
    name: 'نمایندگی',
    photo: c13,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
  {
    id: 14,
    name: 'نمایندگی',
    photo: c14,
    discription:
      'از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.از این رو با همکاری سازمانها، تعاونی ها و ارگانها و همچنین پشتیبانی شبکه بانکی کشور، روشهای مناسبی برای هر کدام از صنوف مختلف را در نظر گرفته که در ادامه معرفی شده اند.',
  },
]

const Contract = ({ contract }) => {
  return (
    <Grid
      xs={12}
      sx={{
        display: 'flex',
        justifyContent: 'center',
        mb: 3,
      }}
    >
      <Paper elevation={8}>
        <CardActionArea component={Link} to={`/contracts/${contract.id}`}>
          <Box
            sx={{
              pb: 2,
            }}
          >
            <CardContent>
              <Grid container spacing={2}>
                <Grid xs={12} md={4}>
                  <img alt={contract.name} src={contract.photo} />
                </Grid>
                <Grid
                  xs={12}
                  md={8}
                  sx={{
                    display: 'flex',
                    flexDirection: 'column',
                    justifyContent: 'space-between',
                  }}
                >
                  <Box>
                    <Typography
                      color="secondary"
                      variant="subtitle1"
                      textAlign="left"
                      gutterBottom
                    >
                      {contract.name}
                    </Typography>
                    <Typography
                      variant="caption"
                      color="text.secondary"
                      gutterBotton
                    >
                      <LinesEllipsis text={contract.discription} maxLine={6} />
                    </Typography>{' '}
                  </Box>{' '}
                </Grid>
              </Grid>
            </CardContent>{' '}
          </Box>
        </CardActionArea>
      </Paper>
    </Grid>
  )
}

const Contracts = () => {
  return (
    <>
      <Paper elevation={5} sx={{ my: 5 }}>
        <Grid container>
          <Grid
            xs={12}
            md={6}
            sx={{
              p: 2,
              display: 'flex',
              flexDirection: 'column',
              textAlign: 'left',
            }}
          >
            <Typography variant="h6" gutterBottom color="secondary">
              با خیال راحت خرید کنید
            </Typography>
            <Typography variant="caption" color="text.secondary">
              نمایندگان فروشگاه فرش 24 ساعته در تلاشند تا رضایت کامل مشتریان خود
              را جلب کنند
            </Typography>
            <Typography
              variant="subtitle1"
              color="text.primary"
              sx={{ display: 'flex', mt: 2 }}
            >
              تعداد نمایندگی های فعال :
              <Typography variant="h5" color="primary" sx={{ ml: 1 }}>
                {data.length}
              </Typography>
            </Typography>
          </Grid>

          <Grid
            xs={12}
            md={6}
            sx={{
              p: 2,
              display: 'flex',
              flexDirection: 'column',
              textAlign: 'left',
            }}
          >
            <Typography variant="subtitle1" color="text.secondary" gutterBottom>
              جستجو میان نمایندگی ها:
            </Typography>
            <TextField
              variant="outlined"
              placeholder="جستجو"
              InputProps={{
                style: {
                  paddingLeft: 3,
                },
                startAdornment: (
                  <InputAdornment position="start">
                    <Search />
                  </InputAdornment>
                ),
              }}
            />
          </Grid>
        </Grid>
      </Paper>
      <Grid container spacing={0.5} sx={{ width: 1 }}>
        {data.map((contract, index) => (
          <Contract contract={contract} key={index} />
        ))}
      </Grid>
    </>
  )
}

export default Contracts
